In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame({
    'A': [1,6,9],
    'B': [2,8,3]
})

In [4]:
df

   A  B
0  1  2
1  6  8
2  9  3

In [6]:
# conversion Dataframe a Array de Numpy
arr1 = df.values
arr1

array([[1, 2],
       [6, 8],
       [9, 3]], dtype=int64)

In [8]:
arr2 = df.to_numpy()
arr2

array([[1, 2],
       [6, 8],
       [9, 3]], dtype=int64)

In [9]:
np.sqrt(df)

         A         B
0  1.00000  1.414214
1  2.44949  2.828427
2  3.00000  1.732051

In [12]:
np.max(df)

C:\Users\Usuario\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:84: FutureWarning: In a future version, DataFrame.max(axis=None) will return a scalar max over the entire DataFrame. To retain the old behavior, use 'frame.max(axis=0)' or just 'frame.max()'
  return reduction(axis=axis, out=out, **passkwargs)

A    9
B    8
dtype: int64

In [15]:
# conversion Array de Numpy a Dataframe
df2 = pd.DataFrame(arr1, columns=['A', 'B'])

In [16]:
df2

   A  B
0  1  2
1  6  8
2  9  3

In [17]:
# ej 1

In [18]:
mi_dataframe = pd.DataFrame({
    "Frutas": ["Manzana", "Banana" , "Cereza"],
    "Cantidad": [5, 8 , 3]
})

In [19]:
mi_dataframe

    Frutas  Cantidad
0  Manzana         5
1   Banana         8
2   Cereza         3

In [22]:
mi_dataframe_np = mi_dataframe.values
mi_dataframe_np

array([['Manzana', 5],
       ['Banana', 8],
       ['Cereza', 3]], dtype=object)

In [23]:
# ej 2

In [25]:
mi_dataframe_filtrado = mi_dataframe[mi_dataframe['Cantidad'] > 4]
mi_dataframe_filtrado

    Frutas  Cantidad
0  Manzana         5
1   Banana         8

In [26]:
mi_dataframe_filtrado_np = mi_dataframe_filtrado.values
mi_dataframe_filtrado_np

array([['Manzana', 5],
       ['Banana', 8]], dtype=object)

In [27]:
# ej 3

In [28]:
mi_array = np.array([[10,20,30],[40,50,60]])
mi_array

array([[10, 20, 30],
       [40, 50, 60]])

In [29]:
df_numeros = pd.DataFrame(mi_array)
df_numeros

    0   1   2
0  10  20  30
1  40  50  60